# Задача №1:
# Запросить ввод строки, вывести развернутую строку
#
# Вариант решения №2, через [::-1]
#
# =!!= Запускать с помощью Python3 =!!=

# Вводим строку
sinp = input( 'Введите строку ' )

# Выводим результат
print( sinp[::-1] )

